/* afpAccessDenied */
"-5000.message" = "Sinulla ei ole oikeutta avata ohjelmaa %@.";
"-5000.info" = "Pyydä apua tietokoneen tai verkon ylläpitäjältä.";
"-5000.help" = "mh1519";

/* afpAccessDenied - but for document */
"documentPermissionError" = "Sinulla ei ole oikeutta avata dokumenttia %@.";
"documentPermissionError.info" = "Pyydä apua tietokoneen tai verkon ylläpitäjältä.";
"documentPermissionError.help" = "mh1519";

/* afpInsideTrashErr*/
"-5044.message" = "Ohjelmaa ”%@” ei voida avata, koska se on roskakorissa.";
"-5044.info" = "Jos haluat avata ohjelman, siirrä se pois roskakorista.";

/* kLSAppInTrashErr */
"-10660.message" = "Ohjelmaa ”%@” ei voida avata, koska se on roskakorissa.";
"-10660.info" = "Jos haluat avata ohjelman, siirrä se pois roskakorista.";

/* kLSAppIsInBackupSnapshotErr */
"-10657.message" = "Ohjelmaa %@ ei voida avata, koska se on Time Machine -varmuuskopiossa.";

/* kLSIncompatibleApplicationVersionErr */
"-10664.message" = "Ohjelman %@ tätä versiota ei voida käyttää tämän Mac OS X -version kanssa.";
"-10664.info" = "Sinulla on %@ %@.";
"-10664.help" = "mh24615";

/* kLSIncompatibleApplicationVersionErr with Software Update */
"-10664.message.2" = "Jotta %@ voidaan avata, se on päivitettävä uusimpaan versioon.";
"-10664.info.2" = "Asenna se nyt suorittamalla Ohjelmiston päivitys.";

/* kLSNoRosettaEnvironmentErr */
"-10665.title" = "Jotta voi avata kohteen %@, sinun on asennettava Rosetta. Haluatko asentaa sen nyt?";
"-10665.error.title" = "Jotta voi avata kohteen %@, sinun on asennettava Rosetta.";
"-10665.error.nonetwork" = "Jos haluat asentaa Rosettan, yhdistä internetiin ja avaa %@. Jos et voi yhdistää internetiin, aseta Mac OS X -asennuslevy asemaan, avaa Valinnaiset asennettavat -kansio ja kaksoisosoita Optional Installs -pakettia.";
"-10665.error.noserver" = "Ohjelmistopäivityksiä ei ole nyt saatavilla. Kun ohjelmistopäivityksiä on saatavilla, avaa %@ uudelleen.";
"-10665.error.busy" = "Toinen ohjelmistopäivitys on meneillään. Kun päivitys on valmis, asenna Rosetta avaamalla %@ uudelleen.";
"-10665.error.notfound" = "Jos haluat asentaa Rosettan myöhemmin, avaa %@ uudelleen. Jos et voi yhdistää internetiin, laita Mac OS X -asennuslevy asemaan, avaa Valinnaiset asennettavat -kansio ja kaksoisosoita Optional Installs -pakettia.";

/* kLSNoClassicEnvironmentErr */
"-10828.message" = "Ohjelmaa %@ ei voida avata, koska Classic-ympäristöä ei enää tueta.";

/*kLSIncompatibleSystemVersionErr*/
"-10825.message" = "Ohjelman %@ tätä versiota ei voida käyttää tämän Mac OS X -version kanssa.";
"-10825.info" = "Sinulla on Mac OS X %@. Ohjelma vaatii Mac OS X %@:n tai uudemman.";
"-10825.help" = "mh24616";

/* kLSNoLaunchPermissionErr */
"-10826.message" = "Sinulla ei ole oikeutta avata ohjelmaa %@.";
"-10826.info" = "Pyydä apua tietokoneen tai verkon ylläpitäjältä.";
"-10826.help" = "mh1519";

/* kLSNoExecutableErr */
"-10827.message" = "Ohjelmaa %@ ei voida avata, koska se on vioittunut tai epätäydellinen.";

/* kLSMultipleSessionsNotSupportedErr */
"-10829.message" = "Ohjelmaa %@ ei voida avata, koska joku muu käyttää sitä.";
"-10829.info" = "Pyydä toista käyttäjää sulkemaan ohjelma ja yritä uudelleen.";

/* fnfErr */
"-43.message" = "Ohjelmaa ei löytynyt.";

/* kLSApplicationNotFoundErr -10814 */
kLSApplicationNotFoundErr = "Dokumentin %@ avaamiseen ei ole määritelty oletusohjelmaa.";
kLSApplicationNotFoundErr.url = "Osoitteen %@ avaamiseen ei ole määritelty oletusohjelmaa.";

/* this is the default message we use if no other error was found */
default.message = "Ohjelmaa ”%@” ei voida avata.";
default.info = "%d";

default2.message = "Ohjelmaa ei voida avata.";

/* kLSExecutableIncorrectFormat -10661 */
"-10661.message" = "Ohjelmaa %@ ei voida avata, koska tämäntyyppinen Mac ei tue sitä.";

SU_BUTTON = "Ohjelmiston päivitys…";

OK = "OK";